minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
//#include <Ticker.h>

#include <ESP8266NetBIOS.h>
//#include <DNSServer.h>
//#include <ESP8266SSDP.h>

//#include <StreamString.h>
//#include <ESP8266WiFi.h>
//#include <ESP8266mDNS.h>
//#include <ArduinoOTA.h>
//#include <FS.h>
//#include <Hash.h>
//#include <ESPAsyncTCP.h>
//#include <ESPAsyncWebServer.h>
//#include <SPIFFSEditor.h>
//#include "AsyncJson.h"
//#include "ArduinoJson.h"
//#include "config.h"

#include "sholat.h"
#include "sholathelper.h"
#include "timehelper.h"

#include <pgmspace.h>
#include "asyncserver.h"
// #include "buzzer.h"

#if defined(ARDUINO) && ARDUINO >= 100
#include "Arduino.h"
#else
#include "WProgram.h"
#endif

#include "PingAlive.h"

#define PRINTPORT Serial
#define DEBUGPORT Serial

// #define RELEASE
//#define RELEASEASYNCWS

#define PRINT(fmt, ...)                      \
  {                                          \
    static const char pfmt[] PROGMEM = fmt;  \
    PRINTPORT.printf_P(pfmt, ##__VA_ARGS__); \
  }

#ifndef RELEASE
#define DEBUGLOG(fmt, ...)                   \
  {                                          \
    static const char pfmt[] PROGMEM = fmt;  \
    DEBUGPORT.printf_P(pfmt, ##__VA_ARGS__); \
  }
#else
#define DEBUGLOG(...)
#endif

#ifndef RELEASEASYNCWS
#define DEBUGASYNCWS(fmt, ...)               \
  {                                          \
    static const char pfmt[] PROGMEM = fmt;  \
    DEBUGPORT.printf_P(pfmt, ##__VA_ARGS__); \
  }
#else
#define DEBUGASYNCWS(...)
#endif

#define AP_ENABLE_BUTTON 4 // Button pin to enable AP during startup for configuration. -1 to disable
//#define CONFIG_FILE "/config.json"
#define USER_CONFIG_FILE "/userconfig.json"
#define GENERIC_CONFIG_FILE "/genericconfig.json"
#define SECRET_FILE "/secret.json"
#define RUNNING_TEXT_FILE "/runningtext.txt"
#define RUNNING_TEXT_FILE_2 "/runningtext_2.txt"

strConfig _config;
strApConfig _configAP; // Static AP config settings
strHTTPAuth _httpAuth;

Ticker _secondTk;
Ticker restartESP;

//FS* _fs;
unsigned long wifiDisconnectedSince = 0;
String _browserMD5 = "";
uint32_t _updateSize = 0;

bool eventsourceTriggered = false;
bool wsConnected = false;
bool configNetworkUpdatedFlag = false;

WiFiEventHandler onStationModeConnectedHandler, onStationModeGotIPHandler, onStationModeDisconnectedHandler;
WiFiEventHandler stationConnectedHandler;
WiFiEventHandler stationDisconnectedHandler;
WiFiEventHandler probeRequestPrintHandler;
WiFiEventHandler probeRequestBlinkHandler;

bool wifiGotIpFlag = false;
bool wifiDisconnectedFlag = false;
bool stationConnectedFlag = false;
bool stationDisconnectedFlag = false;

bool firmwareUpdated = false;

// SKETCH BEGIN

FSInfo fs_info;

DNSServer dnsServer;

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
AsyncEventSource events("/events");

uint32_t clientID;

bool clientVisitConfigRunningLedPage = false;
bool clientVisitConfigSholatPage = false;

bool clientVisitStatusNetworkPage = false;
bool clientVisitStatusTimePage = false;
bool clientVisitStatusSystemPage = false;
bool clientVisitSetTimePage = false;

bool clientVisitInfoPage = false;
bool clientVisitSholatTimePage = false;

void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
{
  if (type == WS_EVT_CONNECT)
  {
    DEBUGASYNCWS("ws[%s][%u] connect\r\n", server->url(), client->id());
    client->printf("Hello Client %u :)", client->id());
    client->ping();
    wsConnected = true;
    //wsSendTimeData();
    clientID = client->id();

    client->status();

    // reset state
    clientVisitConfigRunningLedPage = false;
    clientVisitConfigSholatPage = false;
    clientVisitStatusNetworkPage = false;
    clientVisitStatusTimePage = false;
    clientVisitStatusSystemPage = false;
    clientVisitInfoPage = false;
    clientVisitSholatTimePage = false;

    static uint32_t clientID_old = 0;
    if (clientID != clientID_old && clientID != 0)
    {
      DEBUGASYNCWS("New client is connected, ID  %d\r\n", clientID);

      // if old client exist, instruct old client to 'kill' its connection :)
      if (ws.hasClient(clientID_old))
      {
        DEBUGASYNCWS("Disconnect old client, ID %d\r\n", clientID_old);
        // ws.text(clientID_old, FPSTR(F("suicide")));

        //client->text(PSTR("text"));
        //const char flash_text[] PROGMEM = "Text to send";
        //client->text(FPSTR(flash_text));
        //const_cast<char *>(_config.deviceName.c_str());
        //const char flash_text[] PROGMEM = "Text to send";
        //ws.close(clientID_old, 1013, const_cast<char *>PSTR("text"));

        //String text = pgm_txt_serverloseconnection;
        //ws.close(clientID_old, 4000, const_cast<char *>(text.c_str()));

        int len = strlen_P(pgm_txt_serverloseconnection);
        char text[len];
        strcpy_P(text, pgm_txt_serverloseconnection);
        text[len] = '\0';
        ws.close(clientID_old, 4000, text);
      }

      clientID_old = clientID;
    }
    //zulu = client;
    //request->client()->remoteIP();
    //Serial.println(zulu->remoteIP());
    //Serial.println(client->request->url());
    //Serial.println(client->request->url().c_str());
    //AsyncWebHeader* h = request->getHeader(i);
    //AsyncWebServerRequest *request;
    //Serial.println(request->url().c_str());
  }
  else if (type == WS_EVT_DISCONNECT)
  {
    DEBUGASYNCWS("ws[%s][%u] disconnect: [%u]\r\n", server->url(), client->id(), client->id());
    //_secondTk.detach();
    //eventsourceTriggered = false;
    wsConnected = false;
    //clientID = 0;
  }
  else if (type == WS_EVT_ERROR)
  {
    DEBUGASYNCWS("ws[%s][%u] error(%u): %s\r\n", server->url(), client->id(), *((uint16_t *)arg), (char *)data);
  }
  else if (type == WS_EVT_PONG)
  {
    DEBUGASYNCWS("ws[%s][%u] pong[%u]: %s\r\n", server->url(), client->id(), len, (len) ? (char *)data : "");
  }
  else if (type == WS_EVT_DATA)
  {
    AwsFrameInfo *info = (AwsFrameInfo *)arg;
    char msg[len + 1];
    // msg[0] = '\0';
    if (info->final && info->index == 0 && info->len == len)
    {
      //the whole message is in a single frame and we got all of it's data
      DEBUGLOG("ws[%s][%u] %s-message[%u]: ", server->url(), client->id(), (info->opcode == WS_TEXT) ? "text" : "binary", (uint32_t)info->len);

      if (info->opcode == WS_TEXT)
      {
        Serial.print("case A ");
        for (size_t i = 0; i < info->len; i++)
        {
          msg[i] = (char)data[i];
        }
      }
      else
      {
        Serial.print("case B ");
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len + 1] = '\0';
      DEBUGASYNCWS("%s\r\n", msg);

      if (info->opcode == WS_TEXT)
      {
        client->text(FPSTR(pgm_txt_gotyourtextmessage));
      }
      else
      {
        client->binary(FPSTR(pgm_txt_gotyourbinarymessage));
      }
    }
    else
    {
      //message is comprised of multiple frames or the frame is split into multiple packets
      if (info->index == 0)
      {
        if (info->num == 0)
          DEBUGASYNCWS("ws[%s][%u] %s-message start\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
        DEBUGASYNCWS("ws[%s][%u] frame[%u] start[%llu]\r\n", server->url(), client->id(), info->num, info->len);
      }

      DEBUGASYNCWS("ws[%s][%u] frame[%u] %s[%llu - %llu]: ", server->url(), client->id(), info->num, (info->message_opcode == WS_TEXT) ? "text" : "binary", info->index, info->index + len);

      if (info->opcode == WS_TEXT)
      {
        Serial.print("case C ");
        for (size_t i = 0; i < info->len; i++)
        {
          msg[i] = (char)data[i];
        }
      }
      else
      {
        Serial.print("case D ");
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len] = '\0';
      DEBUGASYNCWS("%s\r\n", msg);

      if ((info->index + len) == info->len)
      {
        DEBUGASYNCWS("ws[%s][%u] frame[%u] end[%llu]\r\n", server->url(), client->id(), info->num, info->len);
        if (info->final)
        {
          DEBUGASYNCWS("ws[%s][%u] %s-message end\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
          if (info->message_opcode == WS_TEXT)
            client->text(pgm_txt_gotyourtextmessage);
          else
            client->binary(pgm_txt_gotyourbinarymessage);
        }
      }
    }

    if (strncmp_P(msg, pgm_schedulepagesholat, strlen_P(pgm_schedulepagesholat)) == 0)
    {
      clientVisitSholatTimePage = true;
      sendSholatSchedule(2);
    }
    else if (strncmp_P(msg, pgm_settimepage, strlen_P(pgm_settimepage)) == 0)
    {
      clientVisitSetTimePage = true;
    }
    else if (strncmp_P(msg, pgm_statuspagesystem, strlen_P(pgm_statuspagesystem)) == 0)
    {
      clientVisitStatusSystemPage = true;
    }
  }
}

void AsyncWSBegin()
{
  DEBUGASYNCWS("Async WebServer Init...\r\n");

  // Register wifi Event to control connection LED
  onStationModeConnectedHandler = WiFi.onStationModeConnected([](WiFiEventStationModeConnected data) {
    onWiFiConnected(data);
  });
  onStationModeGotIPHandler = WiFi.onStationModeGotIP([](WiFiEventStationModeGotIP data) {
    onWifiGotIP(data);
  });
  // onStationModeGotIPHandler = WiFi.onStationModeGotIP(onWifiGotIP);
  onStationModeDisconnectedHandler = WiFi.onStationModeDisconnected([](WiFiEventStationModeDisconnected data) {
    onWiFiDisconnected(data);
  });

  // Register event handlers.
  // Callback functions will be called as long as these handler objects exist.
  // Call "onStationConnected" each time a station connects
  stationConnectedHandler = WiFi.onSoftAPModeStationConnected(&onStationConnected);
  // Call "onStationDisconnected" each time a station disconnects
  stationDisconnectedHandler = WiFi.onSoftAPModeStationDisconnected(&onStationDisconnected);
  // Call "onProbeRequestPrint" and "onProbeRequestBlink" each time
  // a probe request is received.
  // Former will print MAC address of the station and RSSI to Serial,
  // latter will blink an LED.
  probeRequestPrintHandler = WiFi.onSoftAPModeProbeRequestReceived(&onProbeRequestPrint);
  probeRequestBlinkHandler = WiFi.onSoftAPModeProbeRequestReceived(&onProbeRequestBlink);

  int reading = analogRead(A0);
  DEBUGASYNCWS("Analog Read: %d\r\n", reading);
  if (reading >= 768)
  {                            // analog read 3 volts or more
    _configAP.APenable = true; // Read AP button. If button is pressed, activate AP
    DEBUGASYNCWS("AP Enable = %d\r\n", _configAP.APenable);
  }

  //  if (!_fs) // If SPIFFS is not started
  //    _fs->begin();

