minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
char *macToString(const unsigned char *mac)
{
  static char buf[20];
  snprintf(buf, sizeof(buf), "%02x:%02x:%02x:%02x:%02x:%02x",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return buf;
}

void handleFileList(AsyncWebServerRequest *request)
{
  if (!request->hasArg("dir"))
  {
    request->send(500, "text/plain", "BAD ARGS");
    return;
  }

  String path = request->arg("dir");
  DEBUGLOG("handleFileList: %s\r\n", path.c_str());
  Dir dir = SPIFFS.openDir(path);
  path = String();

  String output = "[";
  while (dir.next())
  {
    File entry = dir.openFile("r");
    if (true) //entry.name()!="secret.json") // Do not show secrets
    {
      if (output != "[")
        output += ',';
      bool isDir = false;
      output += "{\"type\":\"";
      output += (isDir) ? "dir" : "file";
      output += "\",\"name\":\"";
      output += String(entry.name()).substring(1);
      output += "\"}";
    }
    entry.close();
  }

  output += "]";
  DEBUGLOG("%s\r\n", output.c_str());
  request->send(200, "application/json", output);
}

void send_network_configuration_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File configFile = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!configFile)
  {
    DEBUGASYNCWS("Failed to open config file");
    return;
  }

  size_t size = configFile.size();
  DEBUGLOG("JSON file size: %d bytes\r\n", size);
  char buf[size];
  configFile.readBytes(buf, size);
  buf[size] = '\0';
  configFile.close();

  request->send(200, "text/plain", buf);
}

void send_connection_state_values_html(AsyncWebServerRequest *request)
{
  String state = "N/A";
  String Networks = "";
  if (WiFi.status() == 0)
    state = "Idle";
  else if (WiFi.status() == 1)
    state = "NO SSID AVAILBLE";
  else if (WiFi.status() == 2)
    state = "SCAN COMPLETED";
  else if (WiFi.status() == 3)
    state = "CONNECTED";
  else if (WiFi.status() == 4)
    state = "CONNECT FAILED";
  else if (WiFi.status() == 5)
    state = "CONNECTION LOST";
  else if (WiFi.status() == 6)
    state = "DISCONNECTED";

  WiFi.scanNetworks(true);

  String values = "";
  values += "connectionstate|" + state + "|div\r\n";
  //values += "networks|Scanning networks ...|div\r\n";
  request->send(200, "text/plain", values);
  state = "";
  values = "";
  Networks = "";
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
}

void sendNetworkStatus(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_chipid)] = ESP.getChipId();
  root[FPSTR(pgm_hostname)] = _config.hostname;
  uint8_t wifiMode = WiFi.getMode();
  if (wifiMode == WIFI_AP)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP);
  }
  else if (wifiMode == WIFI_STA)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_STA);
  }
  else if (wifiMode == WIFI_AP_STA)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP_STA);
  }
  else if (wifiMode == WIFI_OFF)
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_OFF);
  }
  else
  {
    root[FPSTR(pgm_mode)] = FPSTR(pgm_NA);
  }
  root[FPSTR(pgm_ssid)] = WiFi.SSID();
  root[FPSTR(pgm_sta_ip)] = WiFi.localIP().toString();
  root[FPSTR(pgm_sta_mac)] = WiFi.macAddress();
  root[FPSTR(pgm_ap_ip)] = WiFi.softAPIP().toString();
  root[FPSTR(pgm_ap_mac)] = WiFi.softAPmacAddress();
  root[FPSTR(pgm_gateway)] = WiFi.gatewayIP().toString();
  root[FPSTR(pgm_netmask)] = WiFi.subnetMask().toString();
  root[FPSTR(pgm_dns0)] = WiFi.dnsIP().toString();
  root[FPSTR(pgm_dns1)] = WiFi.dnsIP(1).toString();

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void sendTimeStatus(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_date)] = getDateStr();
  root[FPSTR(pgm_time)] = getTimeStr();
  root[FPSTR(pgm_uptime)] = getUptimeStr();
  root[FPSTR(pgm_lastboot)] = getLastBootStr();
  if (lastSync != 0)
  {
    root[FPSTR(pgm_lastsync)] = getLastSyncStr();
    root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  }
  else
  {
    root[FPSTR(pgm_lastsync)] = FPSTR(pgm_never);
    root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  }

  root["ping_seq_num_send"] = ping_seq_num_send;
  root["ping_seq_num_recv"] = ping_seq_num_recv;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

int apgm_lastIndexOf(uint8_t c, const char *p)
{
  int last_index = -1; // -1 indicates no match
  uint8_t b;
  for (int i = 0; true; i++)
  {
    b = pgm_read_byte(p++);
    if (b == c)
      last_index = i;
    else if (b == 0)
      break;
  }
  return last_index;
}

void sendHeap(uint8_t mode)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  StaticJsonBuffer<128> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_heap)] = heap;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void sendDateTime(uint8_t mode)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  tm *tm = localtime(&now);

  root["d"] = tm->tm_mday;
  root["m"] = tm->tm_mon;
  root["y"] = tm->tm_year;
  root["hr"] = tm->tm_hour;
  root["min"] = tm->tm_min;
  root["sec"] = tm->tm_sec;
  root["tz"] = _configLocation.timezone;
  root["utc"] = now;
  root["local"] = mktime(tm);

  size_t len = root.measurePrettyLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
    // events.send(buf, "timeDate", millis());
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

