minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
void restart_esp(AsyncWebServerRequest *request)
{
  request->send_P(200, "text/html", Page_WaitAndReload);
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  SPIFFS.end(); // SPIFFS.end();

  /*
    GPIO 0  GPIO 2  GPIO 15
    UART Download Mode (Programming)  0       1       0
    Flash Startup (Normal)            1       1       0
    SD - Card Boot                      0       0       1
  */

  //WiFi.forceSleepBegin(); wdt_reset(); ESP.restart(); while(1)wdt_reset();

  //ESP.restart();

  restartESP.attach(1.0f, restart_1); // Task to run periodic things every second
}

void restart_1()
{
  // digitalWrite(0, HIGH); //GPIO0
  // digitalWrite(2, HIGH); //GPIO2
  // digitalWrite(15, LOW); //GPIO15
  ESP.restart();
}

void reset_esp(AsyncWebServerRequest *request)
{
  request->send_P(200, "text/html", Page_WaitAndReload);
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  SPIFFS.end(); // SPIFFS.end();
  //delay(1000);
  //ESP.reset();
  restartESP.attach(1.0f, reset_1); // Task to run periodic things every second
}

void reset_1()
{
  // digitalWrite(0, HIGH); //GPIO0
  // digitalWrite(2, HIGH); //GPIO2
  // digitalWrite(15, LOW); //GPIO15
  ESP.reset();
  //ESP.restart();
}

void send_wwwauth_configuration_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();
  if (_httpAuth.auth)
  {
    root[FPSTR(pgm_wwwauth)] = true;
  }
  else
  {
    root[FPSTR(pgm_wwwauth)] = false;
  }
  root[FPSTR(pgm_wwwuser)] = _httpAuth.wwwUsername;
  root[FPSTR(pgm_wwwpass)] = _httpAuth.wwwPassword;

  AsyncResponseStream *response = request->beginResponseStream("text/plain");
  root.printTo(*response);
  request->send(response);
}

void send_wwwauth_configuration_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s %d\r\n", __FUNCTION__, request->args());

  //List all parameters
  int params = request->params();
  if (params)
  {
    for (int i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      { //p->isPost() is also true
        DEBUGASYNCWS("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGASYNCWS("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        //      if (p->name() == "wwwauth") {
        //        _httpAuth.auth = p->value();
        //      }
        if (request->hasParam("wwwauth", true))
        {
          if (p->name() == "wwwauth")
          {
            _httpAuth.auth = p->value();
          }
          if (p->name() == "wwwuser")
          {
            strlcpy(_httpAuth.wwwUsername, p->value().c_str(), sizeof(_httpAuth.wwwUsername));
          }
          if (p->name() == "wwwpass")
          {
            strlcpy(_httpAuth.wwwPassword, p->value().c_str(), sizeof(_httpAuth.wwwPassword));
          }
        }
      }
      else
      {
        DEBUGASYNCWS("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
    }
  }
  else
  {
    _httpAuth.auth = false;
  }

  //save settings
  saveHTTPAuth();

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwauth", true))
  //   AsyncWebParameter* p = request->getParam("wwwauth", true);

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwuser", true))
  //   AsyncWebParameter* p = request->getParam("wwwuser", true);

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("wwwpass", true))
  //   AsyncWebParameter* p = request->getParam("wwwpass", true);

  request->send(SPIFFS, request->url());
}

bool saveHTTPAuth()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();
  json[FPSTR(pgm_wwwauth)] = _httpAuth.auth;
  json[FPSTR(pgm_wwwuser)] = _httpAuth.wwwUsername;
  json[FPSTR(pgm_wwwpass)] = _httpAuth.wwwPassword;

  //TODO add AP data to html
  File file = SPIFFS.open(SECRET_FILE, "w");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open secret file for writing\r\n");
    file.close();
    return false;
  }

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif // RELEASE

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

void send_update_firmware_values_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);
  String values = "";
  uint32_t freeSketchSpace = ESP.getFreeSketchSpace();
  uint32_t maxSketchSpace = (ESP.getSketchSize() - 0x1000) & 0xFFFFF000;
  //bool updateOK = Update.begin(maxSketchSpace);
  bool updateOK = maxSketchSpace < freeSketchSpace;
  StreamString result;
  Update.printError(result);
  DEBUGASYNCWS("--FreeSketchSpace: %d\r\n", freeSketchSpace);
  DEBUGASYNCWS("--MaxSketchSpace: %d\r\n", maxSketchSpace);
  DEBUGASYNCWS("--Update error = %s\r\n", result.c_str());
  values += "remupd|" + (String)((updateOK) ? "OK" : "ERROR") + "|div\n";

  if (Update.hasError())
  {
    result.trim();
    values += "remupdResult|" + result + "|div\n";
  }
  else
  {
    values += "remupdResult||div\n";
  }

  request->send(200, "text/plain", values);
}

void setUpdateMD5(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s %d\r\n", __FUNCTION__, request->args());

  const char *browserMD5 = nullptr;

  int params = request->params();
  if (params)
  {
    for (int i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      { //p->isPost() is also true
        DEBUGASYNCWS("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGASYNCWS("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        if (request->hasParam("md5", true))
        {
          if (p->name() == "md5")
          {
            browserMD5 = p->value().c_str();
            Update.setMD5(browserMD5);
          }
          if (p->name() == "size")
          {
            _updateSize = atoi(p->value().c_str());
            DEBUGASYNCWS("Update size: %u\r\n", _updateSize);
          }
        }
      }
      else
      {
        DEBUGASYNCWS("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        if (request->hasParam("md5"))
        {
          if (p->name() == "md5")
          {
            browserMD5 = p->value().c_str();
            Update.setMD5(browserMD5);
          }
          if (p->name() == "size")
          {
            _updateSize = atoi(p->value().c_str());
            DEBUGASYNCWS("Update size: %u\r\n", _updateSize);
          }
        }
      }
    }

