minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_location)] = _configLocation.city;
  root[FPSTR(pgm_latitude)] = _configLocation.latitude;
  root[FPSTR(pgm_longitude)] = _configLocation.longitude;
  root[FPSTR(pgm_timezone)] = _configLocation.timezone;

  // calcMethod
  if (_sholatConfig.calcMethod == Jafari)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Jafari);
  }
  else if (_sholatConfig.calcMethod == Karachi)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Karachi);
  }
  else if (_sholatConfig.calcMethod == ISNA)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_ISNA);
  }
  else if (_sholatConfig.calcMethod == MWL)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_MWL);
  }
  else if (_sholatConfig.calcMethod == Makkah)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Makkah);
  }
  else if (_sholatConfig.calcMethod == Egypt)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Egypt);
  }
  else if (_sholatConfig.calcMethod == Custom)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Custom);
  }

  //asrMethod
  if (_sholatConfig.asrJuristic == Shafii)
  {
    root[FPSTR(pgm_asrJuristic)] = 0;
  }
  else if (_sholatConfig.asrJuristic == Hanafi)
  {
    root[FPSTR(pgm_asrJuristic)] = 1;
  }

  // highLatsAdjustMethod
  if (_sholatConfig.highLatsAdjustMethod == None)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 0;
  }
  else if (_sholatConfig.highLatsAdjustMethod == MidNight)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 1;
  }
  else if (_sholatConfig.highLatsAdjustMethod == OneSeventh)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 2;
  }
  else if (_sholatConfig.highLatsAdjustMethod == AngleBased)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = 3;
  }

  root[FPSTR(pgm_fajrAngle)] = _sholatConfig.fajrAngle;
  root[FPSTR(pgm_maghribAngle)] = _sholatConfig.maghribAngle;
  root[FPSTR(pgm_ishaAngle)] = _sholatConfig.ishaAngle;
  root[FPSTR(pgm_offsetImsak)] = _sholatConfig.offsetImsak;
  root[FPSTR(pgm_offsetFajr)] = _sholatConfig.offsetFajr;
  root[FPSTR(pgm_offsetSunrise)] = _sholatConfig.offsetSunrise;
  root[FPSTR(pgm_offsetDhuhr)] = _sholatConfig.offsetDhuhr;
  root[FPSTR(pgm_offsetAsr)] = _sholatConfig.offsetAsr;
  root[FPSTR(pgm_offsetSunset)] = _sholatConfig.offsetSunset;
  root[FPSTR(pgm_offsetMaghrib)] = _sholatConfig.offsetMaghrib;
  root[FPSTR(pgm_offsetIsha)] = _sholatConfig.offsetIsha;

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, sizeof(buf));

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

void set_time_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  //List all parameters
  int params = request->params();
  for (int i = 0; i < params; i++)
  {
    AsyncWebParameter *p = request->getParam(i);
    if (p->isFile())
    { //p->isPost() is also true
      Serial.printf("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
    }
    else if (p->isPost())
    {
      Serial.printf("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
    }
    else
    {
      Serial.printf("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
    }
  }

  // //Check if GET parameter exists
  // if (request->hasParam("download"))
  //   AsyncWebParameter* p = request->getParam("download");

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("download", true))
  //   AsyncWebParameter* p = request->getParam("download", true);

  // //Check if FILE was uploaded
  // if (request->hasParam("download", true, true))
  //   AsyncWebParameter* p = request->getParam("download", true, true);

  //handleFileRead("/setrtctime.html", request);
  request->send(SPIFFS, request->url());
}

bool load_config_location()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config LOCATION file\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("config LOCATION file size: %d bytes\r\n", size);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);
  file.close();

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config LOCATION file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
#endif

  strlcpy(_configLocation.city, root[FPSTR(pgm_city)], sizeof(_configLocation.city));
  _configLocation.timezone = root[FPSTR(pgm_timezone)];
  _configLocation.latitude = root[FPSTR(pgm_latitude)];
  _configLocation.longitude = root[FPSTR(pgm_longitude)];

  DEBUGASYNCWS("\r\nConfig LOCATION loaded successfully.\r\n");
  DEBUGASYNCWS("city: %s\r\n", _configLocation.city);
  DEBUGASYNCWS("timezone: %d\r\n", _configLocation.timezone);
  DEBUGASYNCWS("latitude: %f\r\n", _configLocation.latitude);
  DEBUGASYNCWS("longitude: %f\r\n", _configLocation.longitude);

  return true;
}

bool load_config_network()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\r\n");
    file.close();
    return false;
  }

  // size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", file.size());

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);

  file.close();

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config NETWORK file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  // strlcpy(_config.hostname, root[FPSTR(pgm_hostname)], sizeof(_config.hostname));
  strlcpy(_config.ssid, root[FPSTR(pgm_ssid)], sizeof(_config.ssid));
  strlcpy(_config.password, root[FPSTR(pgm_password)], sizeof(_config.password));
  _config.dhcp = root[FPSTR(pgm_dhcp)];
  strlcpy(_config.static_ip, root[FPSTR(pgm_static_ip)], sizeof(_config.static_ip));
  strlcpy(_config.netmask, root[FPSTR(pgm_netmask)], sizeof(_config.netmask));
  strlcpy(_config.gateway, root[FPSTR(pgm_gateway)], sizeof(_config.gateway));
  strlcpy(_config.dns0, root[FPSTR(pgm_dns0)], sizeof(_config.dns0));
  strlcpy(_config.dns1, root[FPSTR(pgm_dns1)], sizeof(_config.dns1));

  DEBUGASYNCWS("\r\nNetwork settings loaded successfully.\r\n");
  DEBUGASYNCWS("hostname: %s\r\n", _config.hostname);
  DEBUGASYNCWS("ssid: %s\r\n", _config.ssid);
  DEBUGASYNCWS("pass: %s\r\n", _config.password);
  DEBUGASYNCWS("dhcp: %d\r\n", _config.dhcp);
  DEBUGASYNCWS("static_ip: %s\r\n", _config.static_ip);
  DEBUGASYNCWS("netmask: %s\r\n", _config.netmask);
  DEBUGASYNCWS("gateway: %s\r\n", _config.gateway);
  DEBUGASYNCWS("dns0: %s\r\n", _config.dns0);
  DEBUGASYNCWS("dns1: %s\r\n", _config.dns1);

