minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
  return true;
}

//*************************
// LOAD HTTPAUTH CONFIG
//*************************
bool load_config_httpauth()
{
  DEBUGASYNCWS("\r\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open("/secret.json", "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open HTTPAUTH file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse json file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  if (
      !root[FPSTR(pgm_wwwauth)].success() ||
      !root[FPSTR(pgm_wwwuser)].success() ||
      !root[FPSTR(pgm_wwwpass)].success())
  {
    DEBUGASYNCWS("Failed to parse httpAuth json file\r\n");
    return false;
  }

  _httpAuth.auth = root[FPSTR(pgm_wwwauth)];
  strlcpy(_httpAuth.wwwUsername, root[FPSTR(pgm_wwwuser)], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, root[FPSTR(pgm_wwwpass)], sizeof(_httpAuth.wwwPassword));

  //check
  DEBUGASYNCWS("httpAuth settings loaded successfully.\r\n");
  DEBUGASYNCWS("Read httpAuth settings from memory:\r\n");
  DEBUGASYNCWS("wwwauth: %d\r\n", _httpAuth.auth);
  DEBUGASYNCWS("wwwuser: %s\r\n", _httpAuth.wwwUsername);
  DEBUGASYNCWS("wwwpass: %s\r\n", _httpAuth.wwwPassword);

  return true;
}

//*************************
// SAVE NETWORK CONFIG
//*************************
bool save_config_network()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();
  // json[FPSTR(pgm_hostname)] = _config.hostname;
  json[FPSTR(pgm_ssid)] = _config.ssid;
  json[FPSTR(pgm_password)] = _config.password;
  json[FPSTR(pgm_dhcp)] = _config.dhcp;
  json[FPSTR(pgm_static_ip)] = _config.static_ip;
  json[FPSTR(pgm_netmask)] = _config.netmask;
  json[FPSTR(pgm_gateway)] = _config.gateway;
  json[FPSTR(pgm_dns0)] = _config.dns0;
  json[FPSTR(pgm_dns1)] = _config.dns1;

  //TODO add AP data to html
  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "w");

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  // EEPROM_write_char(eeprom_wifi_ssid_start, eeprom_wifi_ssid_size, _config.ssid);
  // EEPROM_write_char(eeprom_wifi_password_start, eeprom_wifi_password_size, wifi_password);

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE CONFIG LOCATION
//*************************
bool save_config_location()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();

  json[FPSTR(pgm_city)] = _configLocation.city;
  json[FPSTR(pgm_timezone)] = _configLocation.timezone;
  json[FPSTR(pgm_latitude)] = _configLocation.latitude;
  json[FPSTR(pgm_longitude)] = _configLocation.longitude;

  File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "w");

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE CONFIG TIME
//*************************
bool save_config_time()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();

  json[FPSTR(pgm_dst)] = _configTime.dst;
  json[FPSTR(pgm_enablertc)] = _configTime.enablertc;
  json[FPSTR(pgm_syncinterval)] = _configTime.syncinterval;
  json[FPSTR(pgm_enablentp)] = _configTime.enablentp;
  json[FPSTR(pgm_ntpserver_0)] = _configTime.ntpserver_0;
  json[FPSTR(pgm_ntpserver_1)] = _configTime.ntpserver_1;
  json[FPSTR(pgm_ntpserver_2)] = _configTime.ntpserver_2;

  //json["led"] = config.connectionLed;

  //TODO add AP data to html
  File file = SPIFFS.open(FPSTR(pgm_configfiletime), "w");

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE SHOLAT CONFIG
//*************************
bool save_config_sholat()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  //root[FPSTR(pgm_location)] = _sholatConfig.location;
  //root[FPSTR(pgm_timezone)] = _sholatConfig.timezone;
  //root[FPSTR(pgm_latitude)] = _sholatConfig.latitude;
  //root[FPSTR(pgm_longitude)] = _sholatConfig.longitude;

  // calcMethod
  if (_sholatConfig.calcMethod == Jafari)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Jafari);
  }
  else if (_sholatConfig.calcMethod == Karachi)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Karachi);
  }
  else if (_sholatConfig.calcMethod == ISNA)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_ISNA);
  }
  else if (_sholatConfig.calcMethod == MWL)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_MWL);
  }
  else if (_sholatConfig.calcMethod == Makkah)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Makkah);
  }
  else if (_sholatConfig.calcMethod == Egypt)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Egypt);
  }
  else if (_sholatConfig.calcMethod == Custom)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Custom);
  }

  //asrJuristic
  if (_sholatConfig.asrJuristic == Shafii)
  {
    root[FPSTR(pgm_asrJuristic)] = FPSTR(pgm_Shafii);
  }
  else if (_sholatConfig.asrJuristic == Hanafi)
  {
    root[FPSTR(pgm_asrJuristic)] = FPSTR(pgm_Hanafi);
  }

  // highLatsAdjustMethod
  if (_sholatConfig.highLatsAdjustMethod == None)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_None);
  }
  else if (_sholatConfig.highLatsAdjustMethod == MidNight)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_MidNight);
  }
  else if (_sholatConfig.highLatsAdjustMethod == OneSeventh)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_OneSeventh);
  }
  else if (_sholatConfig.highLatsAdjustMethod == AngleBased)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_AngleBased);
  }

  root[FPSTR(pgm_fajrAngle)] = _sholatConfig.fajrAngle;
  root[FPSTR(pgm_maghribAngle)] = _sholatConfig.maghribAngle;
  root[FPSTR(pgm_ishaAngle)] = _sholatConfig.ishaAngle;
  root[FPSTR(pgm_offsetImsak)] = _sholatConfig.offsetImsak;
  root[FPSTR(pgm_offsetFajr)] = _sholatConfig.offsetFajr;
  root[FPSTR(pgm_offsetSunrise)] = _sholatConfig.offsetSunrise;
  root[FPSTR(pgm_offsetDhuhr)] = _sholatConfig.offsetDhuhr;
  root[FPSTR(pgm_offsetAsr)] = _sholatConfig.offsetAsr;
  root[FPSTR(pgm_offsetSunset)] = _sholatConfig.offsetSunset;
  root[FPSTR(pgm_offsetMaghrib)] = _sholatConfig.offsetMaghrib;
  root[FPSTR(pgm_offsetIsha)] = _sholatConfig.offsetIsha;

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

