minida28/ISLAMIC-PRAYTIMES-ESP8266-OLED-SH1106/src/asyncserver.cpp
  if (wifiGotIpFlag)
  {
    wifiGotIpFlag = false;

    uint8_t mode = WiFi.getMode();
    if (mode == WIFI_AP)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP);
    }
    else if (mode == WIFI_STA)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_STA);
    }
    else if (mode == WIFI_AP_STA)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_AP_STA);
      PRINT("\r\nTurning Off Wifi Access Point...\r\n");
      WiFi.softAPdisconnect(true);
    }
    else if (mode == WIFI_OFF)
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_WIFI_OFF);
    }
    else
    {
      // root[FPSTR(pgm_mode)] = FPSTR(pgm_NA);
    }

    /*
    https://github.com/esp8266/Arduino/blob/4897e0006b5b0123a2fa31f67b14a3fff65ce561/libraries/ESP8266WiFi/src/include/wl_definitions.h

    typedef enum {
    WL_NO_SHIELD        = 255,   // for compatibility with WiFi Shield library
    WL_IDLE_STATUS      = 0,
    WL_NO_SSID_AVAIL    = 1,
    WL_SCAN_COMPLETED   = 2,
    WL_CONNECTED        = 3,
    WL_CONNECT_FAILED   = 4,
    WL_CONNECTION_LOST  = 5,
    WL_DISCONNECTED     = 6
    } wl_status_t;
  */
  }

  if (wifiDisconnectedFlag)
  {
    wifiDisconnectedFlag = false;

    // WiFi.reconnect();
    uint8_t client = WiFi.softAPgetStationNum();

    Serial.printf("\r\nStations connected to soft-AP = %d\r\n", client);

    if (!client)
    {
      WiFi.reconnect();
    }

    static bool apEnable = false;

    if (wifiDisconnectedSince == 0)
    {
      wifiDisconnectedSince = millis();
      apEnable = true;
    }

    if (apEnable == true && (int)((millis() - wifiDisconnectedSince) / 1000) >= 30)
    {
      PRINT("\r\nStarting Wifi Access Point...\r\n");
      // DEBUGPORT.printf_P(PSTR("\r\nStarting Wifi Access Point...\r\n"));
      apEnable = false;
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(_configAP.ssid, _configAP.password);
      WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
    }

    // PRINT("\r\nWifi disconnected for %d seconds\r\n", (int)((millis() - wifiDisconnectedSince) / 1000);
    DEBUGPORT.printf_P(PSTR("\r\nWifi disconnected for %d seconds\r\n"), (int)((millis() - wifiDisconnectedSince) / 1000));
  }

  if (stationConnectedFlag)
  {
    stationConnectedFlag = false;
  }

  if (stationDisconnectedFlag)
  {
    stationDisconnectedFlag = false;
    uint8_t client = WiFi.softAPgetStationNum();

    if (!client)
    {
      WiFi.reconnect();
    }
  }
}

void sendSholatSchedule(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_type)] = FPSTR(pgm_sholatdynamic);
  root[FPSTR(pgm_h)] = HOUR;
  root[FPSTR(pgm_m)] = MINUTE;
  root[FPSTR(pgm_s)] = SECOND;
  root[FPSTR(pgm_curr)] = sholatNameStr(CURRENTTIMEID);
  root[FPSTR(pgm_next)] = sholatNameStr(NEXTTIMEID);

  root[FPSTR(pgm_loc)] = _configLocation.city;
  //  root[FPSTR(pgm_day)] = dayNameStr(weekday(local_time()));
  //  root[FPSTR(pgm_date)] = getDateStr(local_time());
  root[FPSTR(pgm_fajr)] = sholatTimeArray[0];
  root[FPSTR(pgm_syuruq)] = sholatTimeArray[1];
  root[FPSTR(pgm_dhuhr)] = sholatTimeArray[2];
  root[FPSTR(pgm_ashr)] = sholatTimeArray[3];
  root[FPSTR(pgm_maghrib)] = sholatTimeArray[5];
  root[FPSTR(pgm_isya)] = sholatTimeArray[6];

  size_t len = root.measureLength();
  char buf[len + 1];
  root.printTo(buf, len + 1);

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
  }
  else if (mode == 2)
  {
    ws.text(clientID, buf);
  }
}

int pgm_lastIndexOf(uint8_t c, const char *p)
{
  int last_index = -1; // -1 indicates no match
  uint8_t b;
  for (int i = 0; true; i++)
  {
    b = pgm_read_byte(p++);
    if (b == c)
      last_index = i;
    else if (b == 0)
      break;
  }
  return last_index;
}

bool save_system_info()
{
  PRINT("%s\r\n", __PRETTY_FUNCTION__);

  // const char* pathtofile = PSTR(pgm_filesystemoverview);

  File file;
  if (!SPIFFS.exists(FPSTR(pgm_systeminfofile)))
  {
    file = SPIFFS.open(FPSTR(pgm_systeminfofile), "w");
    if (!file)
    {
      PRINT("Failed to open config file for writing\r\n");
      file.close();
      return false;
    }
    //create blank json file
    PRINT("Creating user config file for writing\r\n");
    file.print("{}");
    file.close();
  }
  //get existing json file
  file = SPIFFS.open(FPSTR(pgm_systeminfofile), "w");
  if (!file)
  {
    PRINT("Failed to open config file");
    return false;
  }

  const char *the_path = PSTR(__FILE__);
  // const char *_compiletime = PSTR(__TIME__);

  int slash_loc = pgm_lastIndexOf('/', the_path); // index of last '/'
  if (slash_loc < 0)
    slash_loc = pgm_lastIndexOf('\\', the_path); // or last '\' (windows, ugh)

  int dot_loc = pgm_lastIndexOf('.', the_path); // index of last '.'
  if (dot_loc < 0)
    dot_loc = pgm_lastIndexOf(0, the_path); // if no dot, return end of string

  int lenPath = strlen(the_path);
  int lenFileName = (lenPath - (slash_loc + 1));

  char fileName[lenFileName];
  //Serial.println(lenFileName);
  //Serial.println(sizeof(fileName));

  int j = 0;
  for (int i = slash_loc + 1; i < lenPath; i++)
  {
    uint8_t b = pgm_read_byte(&the_path[i]);
    if (b != 0)
    {
      fileName[j] = (char)b;
      //Serial.print(fileName[j]);
      j++;
      if (j >= lenFileName)
      {
        break;
      }
    }
    else
    {
      break;
    }
  }
  //Serial.println();
  //Serial.println(j);
  fileName[lenFileName] = '\0';

  //const char* _compiledate = PSTR(__DATE__);
  int lenCompileDate = strlen_P(PSTR(__DATE__));
  char compileDate[lenCompileDate];
  strcpy_P(compileDate, PSTR(__DATE__));

  int lenCompileTime = strlen_P(PSTR(__TIME__));
  char compileTime[lenCompileTime];
  strcpy_P(compileTime, PSTR(__TIME__));

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  SPIFFS.info(fs_info);

  root[FPSTR(pgm_totalbytes)] = fs_info.totalBytes;
  root[FPSTR(pgm_usedbytes)] = fs_info.usedBytes;
  root[FPSTR(pgm_blocksize)] = fs_info.blockSize;
  root[FPSTR(pgm_pagesize)] = fs_info.pageSize;
  root[FPSTR(pgm_maxopenfiles)] = fs_info.maxOpenFiles;
  root[FPSTR(pgm_maxpathlength)] = fs_info.maxPathLength;

  root[FPSTR(pgm_filename)] = fileName;
  root[FPSTR(pgm_compiledate)] = compileDate;
  root[FPSTR(pgm_compiletime)] = compileTime;
  root[FPSTR(pgm_lastboot)] = getLastBootStr();
  root[FPSTR(pgm_chipid)] = ESP.getChipId();
  root[FPSTR(pgm_cpufreq)] = ESP.getCpuFreqMHz();
  root[FPSTR(pgm_sketchsize)] = ESP.getSketchSize();
  root[FPSTR(pgm_freesketchspace)] = ESP.getFreeSketchSpace();
  root[FPSTR(pgm_flashchipid)] = ESP.getFlashChipId();
  root[FPSTR(pgm_flashchipmode)] = ESP.getFlashChipMode();
  root[FPSTR(pgm_flashchipsize)] = ESP.getFlashChipSize();
  root[FPSTR(pgm_flashchiprealsize)] = ESP.getFlashChipRealSize();
  root[FPSTR(pgm_flashchipspeed)] = ESP.getFlashChipSpeed();
  root[FPSTR(pgm_cyclecount)] = ESP.getCycleCount();
  root[FPSTR(pgm_corever)] = ESP.getFullVersion();
  root[FPSTR(pgm_sdkver)] = ESP.getSdkVersion();
  root[FPSTR(pgm_bootmode)] = ESP.getBootMode();
  root[FPSTR(pgm_bootversion)] = ESP.getBootVersion();
  root[FPSTR(pgm_resetreason)] = ESP.getResetReason();

  root.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}